articles/emacs-note.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-02-07 Thu 15:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Emacs - 笔记整理 (草稿)</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Xt3">
<link href="/testwebsite/css/org.css" rel="stylesheet"></link>
</head>
<body>
<div id="content">
<h1 class="title">Emacs - 笔记整理 (草稿)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3f199c5">1. Setup 安装</a></li>
<li><a href="#org7819d3e">2. Package Manager 包管理器</a></li>
<li><a href="#orgab44847">3. Coonfig 配置</a></li>
<li><a href="#orgc98c3c0">4. Basic 基础</a>
<ul>
<li><a href="#org657a267">4.1. UI 用户界面</a></li>
<li><a href="#orgbd824cb">4.2. Mode 模式</a></li>
<li><a href="#orgdac8094">4.3. Keybinding 键绑定</a></li>
<li><a href="#org16e8e6b">4.4. Command 命令</a></li>
<li><a href="#org1effda8">4.5. Help 帮助</a></li>
<li><a href="#org39e129a">4.6. Server 服务</a></li>
</ul>
</li>
<li><a href="#org6aab3a6">5. Begining 开始</a></li>
<li><a href="#orga8ab30b">6. Move 移动 &amp; Jump 跳转</a></li>
<li><a href="#orgce22d77">7. Edit 编辑</a>
<ul>
<li><a href="#org19f378f">7.1. Mark 标记</a></li>
<li><a href="#orgf9710c6">7.2. Insert 插入</a></li>
<li><a href="#orgff39381">7.3. 删除 剪切 复制 粘贴</a></li>
<li><a href="#orgff96b8a">7.4. Undo/Redo 撤销 重做</a></li>
<li><a href="#org8e229ef">7.5. Multiple 多重</a></li>
<li><a href="#org557a4dc">7.6. Other 其它</a>
<ul>
<li><a href="#org54cebf1">7.6.1. Align 对齐</a></li>
<li><a href="#org1a2ed62">7.6.2. Sort 排序</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org60f8c03">8. Search 搜索 &amp; Replace 替换</a></li>
<li><a href="#orgf245fe1">9. Repeat 重复</a></li>
<li><a href="#org87f3f52">10. Assist 辅助</a>
<ul>
<li><a href="#orgd9a18ac">10.1. Information 信息</a></li>
<li><a href="#orgff26de5">10.2. Keyboard Macro 键盘宏</a></li>
<li><a href="#org97a2b18">10.3. Abbrev 缩写</a></li>
<li><a href="#orgfee0a85">10.4. Register 寄存器</a></li>
<li><a href="#orgd89a39d">10.5. Bookmark 书签</a></li>
<li><a href="#orga1899e6">10.6. Other</a></li>
</ul>
</li>
<li><a href="#org734721b">11. Special Mode</a>
<ul>
<li><a href="#orgdbf2df3">11.1. Dired</a></li>
<li><a href="#org633cdc3">11.2. Org</a></li>
<li><a href="#org5271a15">11.3. Shell</a></li>
<li><a href="#org475d775">11.4. Git</a></li>
</ul>
</li>
<li><a href="#org53acd35">12. Programming</a>
<ul>
<li><a href="#org7d583b0">12.1. C</a></li>
<li><a href="#org52f98e5">12.2. Lisp</a></li>
</ul>
</li>
<li><a href="#org66007a4">13. hydra</a>
<ul>
<li><a href="#orge559a3b">13.1. Window</a></li>
<li><a href="#orgba2f9d0">13.2. hydra mc</a></li>
</ul>
</li>
<li><a href="#org0d5224b">14. Config</a>
<ul>
<li><a href="#org8afc42d">14.1. Ace Window</a></li>
<li><a href="#orgb55e9bc">14.2. Avy</a></li>
<li><a href="#org7ab7693">14.3. Undo Tree</a></li>
<li><a href="#orgda39039">14.4. whole line or region</a></li>
<li><a href="#org9af7374">14.5. Mutiple cursors</a></li>
<li><a href="#orgd97d13c">14.6. Highlight Line</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org3f199c5" class="outline-2">
<h2 id="org3f199c5"><span class="section-number-2">1</span> Setup 安装</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>OSX : <a href="http://emacsformacosx.com">Emacs For Mac OS X</a></li>
<li>Linux : 用包管理器安装</li>
</ul>
</div>
</div>

<div id="outline-container-org7819d3e" class="outline-2">
<h2 id="org7819d3e"><span class="section-number-2">2</span> Package Manager 包管理器</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>M-x package-list-packages</li>
<li><a href="https://github.com/jwiegley/use-package">use-package</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgab44847" class="outline-2">
<h2 id="orgab44847"><span class="section-number-2">3</span> Coonfig 配置</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>个人喜好 : ~/.emacs.d/init.el -(org-babel)-&gt; ~/.emacs.d/config.org</li>
<li>配置文件(下载): <a href="Emacs/init.el">init.el</a> <a href="Emacs/config.org">config.org</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgc98c3c0" class="outline-2">
<h2 id="orgc98c3c0"><span class="section-number-2">4</span> Basic 基础</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-org657a267" class="outline-3">
<h3 id="org657a267"><span class="section-number-3">4.1</span> UI 用户界面</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>Menu 菜单栏 : 屏幕顶部突出显示的条</li>
<li>Frame 框架
<ul class="org-ul">
<li>Window 窗口
<ul class="org-ul">
<li>Buffer 缓冲区 : 关联文件</li>
</ul></li>
</ul></li>
<li>Mode Line 模式行 (状态栏) : 每个窗口中 横贯底部的高亮条 提供当前缓冲区的信息</li>
<li>Echo Area : 模式行下面 底部的区域 显示相关信息</li>
</ul>

<p>
Mode Line  
</p>
<ul class="org-ul">
<li><a href="https://github.com/Malabarba/smart-mode-line">smart-mode-line</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgbd824cb" class="outline-3">
<h3 id="orgbd824cb"><span class="section-number-3">4.2</span> Mode 模式</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>主要模式 major-mode : 主要的编辑行为 仅用于当前缓冲区 仅有一个活动的主模式</li>
<li>次要模式 minor-mode : 提供了一些与任何特定的主要模式无关的特性或功能 可多个</li>
</ul>
</div>
</div>
<div id="outline-container-orgdac8094" class="outline-3">
<h3 id="orgdac8094"><span class="section-number-3">4.3</span> Keybinding 键绑定</h3>
<div class="outline-text-3" id="text-4-3">
<p>
组合键
</p>
<ul class="org-ul">
<li>Ctrl (C)</li>
<li>Meta (M) 
<ul class="org-ul">
<li>输入 Meta
<ul class="org-ul">
<li>Alt</li>
<li>Esc (按下 Esc, 松开, 再按其它键)</li>
<li>Ctrl-[ 代替 Esc (通过网络运行 Emacs, 无法使用 Esc 和 Alt 键时)</li>
</ul></li>
</ul></li>
<li><p>
For Mac
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Fn -&gt; hyper : H</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> ns-function-modifier 'hyper<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Cmd -&gt; meta : M</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> ns-command-modifier 'meta<span style="color: #8b0000;">)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Opt -&gt; super : S</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> ns-option-modifier 'super<span style="color: #8b0000;">)</span>
</pre>
</div></li>
</ul>

<p>
常用的缺省按键前缀
</p>
<ul class="org-ul">
<li>当前编辑模式特有的命令 : C-c</li>
<li>文件和缓冲区命令 : C-x</li>
<li>帮助命令 : C-h</li>
<li>命令 : M-x</li>
</ul>
</div>
</div>

<div id="outline-container-org16e8e6b" class="outline-3">
<h3 id="org16e8e6b"><span class="section-number-3">4.4</span> Command 命令</h3>
<div class="outline-text-3" id="text-4-4">
<p>
每一个命令 == 一个功能(Elisp函数) 
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">退出 Emacs</td>
<td class="org-left">C-x C-c (confirm-kill-emacs)</td>
</tr>

<tr>
<td class="org-left">取消</td>
<td class="org-left">C-g == keyboard-quit 或 ESC ESC ESC</td>
</tr>

<tr>
<td class="org-left">执行 命令</td>
<td class="org-left">M-x == execute-extended-command</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org1effda8" class="outline-3">
<h3 id="org1effda8"><span class="section-number-3">4.5</span> Help 帮助</h3>
<div class="outline-text-3" id="text-4-5">
<ul class="org-ul">
<li>Tutorial : C-h t</li>
<li>Manual : C-h r == info-emacs-manual
<ul class="org-ul">
<li>Online : <a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/index.html">Emacs manual</a></li>
</ul></li>
<li><p>
当前模式|变量|函数|键绑定|符号
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">C-h m</td>
<td class="org-left">describe-mode</td>
</tr>

<tr>
<td class="org-left">C-h v</td>
<td class="org-left">describe-varible</td>
</tr>

<tr>
<td class="org-left">C-h f</td>
<td class="org-left">describe-function</td>
</tr>

<tr>
<td class="org-left">C-h b</td>
<td class="org-left">describe-bindings</td>
</tr>

<tr>
<td class="org-left">C-h o</td>
<td class="org-left">describe-symbol</td>
</tr>
</tbody>
</table></li>
<li><p>
通过键盘 输入一个键绑定
</p>
<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<tbody>
<tr>
<td class="org-left">C-h c</td>
<td class="org-left">describe-key-briefly</td>
</tr>

<tr>
<td class="org-left">C-h k</td>
<td class="org-left">describe-key</td>
</tr>
</tbody>
</table></li>
</ul>
</div>
</div>

<div id="outline-container-org39e129a" class="outline-3">
<h3 id="org39e129a"><span class="section-number-3">4.6</span> Server 服务</h3>
<div class="outline-text-3" id="text-4-6">
<ul class="org-ul">
<li>开启服务 : M-x server-start
<ul class="org-ul">
<li><p>
初始文件 &lt;&lt;
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span>server-start<span style="color: #8b0000;">)</span>
</pre>
</div></li>
</ul></li>
<li>客服端 : emacsclient    
<ul class="org-ul">
<li>-t &lt;filename&gt;  : open a new frame on the terminal</li>
<li>-c : open a new X frame</li>
<li>-n, &#x2013;no-wait	: Don't wait for the server to return</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org6aab3a6" class="outline-2">
<h2 id="org6aab3a6"><span class="section-number-2">5</span> Begining 开始</h2>
<div class="outline-text-2" id="text-5">
<p>
入门 Emacs 是很简单的事 网络上能够搜索出大量的入门文章和视频 <br>
所以呢 我不打算 做一些重复的工作 <br>
换个角度来试试看 <br>
</p>

<p>
编辑器 用来做什么? 编辑文本 写代码 写书 收发邮件 浏览网页 看图片 看视频 &#x2026;
</p>

<p>
从 编辑文本 开始 : 需要什么?
</p>

<ul class="org-ul">
<li>Move|Jump 移动或跳转 :
<ul class="org-ul">
<li>要在 Buffer中移动 : 字符 单词 行</li>
<li>跳到 不同的 Window中 或 Frame中</li>
</ul></li>
<li>Edit 编辑
<ul class="org-ul">
<li>选中 : 选择需要编辑的部分文本</li>
<li>插入</li>
<li>删除</li>
<li>复制 粘贴 剪切</li>
<li>撤销 重做</li>
<li>处理 : 执行一些特定的功能 如 转换大小写</li>
</ul></li>
<li>Search 搜索</li>
<li>Repeat 重复</li>
<li>Assist
<ul class="org-ul">
<li>Manipulating pairs : smartparens</li>
<li>Narrowing</li>
<li>Folding</li>
</ul></li>
</ul>

<p>
Emacs 是基于文本的 所以 对文本的操作 可以贯穿各种场景 然后根据特定的需要 使用不同的模式 提供更多的功能
</p>
<ul class="org-ul">
<li>主模式
<ul class="org-ul">
<li>Org</li>
<li>Dired</li>
</ul></li>
<li>次要模式
<ul class="org-ul">
<li>abbrew</li>
</ul></li>
</ul>

<p>
再到 我要写代码 建立开发环境 需要什么?
</p>
<ul class="org-ul">
<li>Completion : company</li>
<li>Syntax Checking : flycheck</li>
<li>Format (style, highlight, indent )</li>
<li>Navigation (tag, definition, symbols)</li>
<li>Code Templates &amp; Snippets : yasnippet</li>
<li>Project : progectile, Speedbar</li>
<li>Doc</li>
<li>Enhancement Edit</li>
<li>Assist</li>
<li>Compilation</li>
<li>Debugging</li>
</ul>

<p>
特定的语言 又需要什么?
</p>
<ul class="org-ul">
<li>Common lisp
<ul class="org-ul">
<li>Slime</li>
<li>Enhancement Edit : paredit, lispy</li>
<li>Completion : company-slime</li>
</ul></li>
<li>C</li>
</ul>
</div>
</div>
