articles/emacs-note.org
* Move 移动 & Jump 跳转
光标的定位 (屏幕可视范围内)

Buffer
- 左右
  - C-b|f == (backward|forward)-char 
  - M-b|f == (backward|forward)-word 
- 上|下
  - C-p|n == (previous|next)-line
- 行-首|尾
  - C-a|e == (beginning|end)-of-line
- 句子-首|尾
  - M-a|e == (backward|forward)-sentence
- 段落-首|尾
  - M-{|} == (backward|forward)-paragraph
- 翻页-上|下
  - M|C-v == PgUp|PgDn | scroll-(up|down)-command
- 缓冲区-首|尾
  - M-<|> == (beginning|end)-of-buffer
- 到本行第一个非空字符
  - M-m == back-to-indentation
- N-行
  - M-g (g|M-g) == goto-line
- 当前缓冲区可视区域-(Top|Center|Bottom)
  - M-r == move-to-window-line-top-bottom

Window  
- C-x o == other-window

Frame
- M-x select-frame-by-name

Assist
- Wind Move
  - M-x windmove-(left|right|up|down)
- [[https://github.com/abo-abo/ace-window][Ace Window]]
  - M-x ace-window (Me: == S-o)
- [[https://github.com/abo-abo/avy][Avy]]
  - M-x avy-goto-(char|word-1|line)

Supplement
#+BEGIN_SRC emacs-lisp
;; 设置 sentence-end 可以识别中文标点
(setq sentence-end
      "\\([。！？]\\|……\\|[.?!][]\"')}]*\\($\\|[ \t]\\)\\)[ \t\n]*")
#+END_SRC

* Edit 编辑
- 选中 (标记) : 选择需要编辑的部分文本
- 插入
- 删除 剪切 复制 粘贴
- 撤销 重做
- 处理 : 执行一些特定的功能 如 转换大小写
- 特性 : 矩形区块
  
** Mark 标记
选中 需要编辑的部分文本

- 标记
  - 点
    - C-(<SPC>|@) == set-mark-command (激活) 
    - C-<SPC> C-<SPC> (不激活 但进入标记环)
  - 段落
    - M-h == mark-paragraph
  - 缓冲区
    - C-x h == mark-whole-buffer 
  - Mouse shift-selection
    - Shift-<Mouse>
- 标记环 (Mark Ring : 标记的点 进入 标记环) [Global|Local]
  - 最后标记点
    - C-u C-<SPC> (当前缓冲) 
    - C-x C-<SPC> == pop-global-mark
  - 列表
- 互换位置-插入点和标记点
  - C-x C-x == exchange-point-and-mark

Special
- 标记 表达式 
  - C-M-@ == mark-sexp
- 标记 定义
  - C-M-h == mark-defun

Assist
- 标记环列表: [[https://github.com/emacs-helm/helm][Helm]]
  - M-x helm-mark-all-rings | helm-[global]-mark-ring
- [[https://github.com/magnars/expand-region.el][expand-region]] : er/expand-region == C-=

Supplement
- 整行
  #+BEGIN_SRC emacs-lisp
(defun xt3/sel-cur-line ()
  (interactive)
  (set-mark (line-end-position))
  (beginning-of-line))
(bind-key "C-x M-h" #'xt3/sel-cur-line)
#+END_SRC
** Insert 插入
Input 输入
- 可见的(图形字符) : a..z , 1..0, !..?  
- 控制字符 : <SPC>, <RET>, <TAB>, <DEL>, <ESC>, <F1>, <Home>, <LEFT>
  - 插入空白行 : <RET> | C-j | C-o 
- 修饰键 : <Control>, <META>
- 输入 对应 命令 
- 非键盘 : mouse(鼠标) (一般作为定位 特殊模式 拖拽绘制字符)
- 引用插入
  - C-q == quoted-insert
  - 不可见(非图形字符)
    - <Ret>, C-l(分页符)
    - 033 Enter (Ascii 八进制) = f
- Unicode
  - C-x 8 RET
  - 速记 : C-x 8 C-h £
  - ∑ (2211) ⤶ (2936)

Assist
- Input Method 输入法
  - 内置
    - 触发 : toggle-input-medthod == C-\
    - 切换 : select-input-medthod == C-u C-\ | C-x Ret C-\
    - 示例 :
      - Tex α x₃ X³
        #+BEGIN_EXAMPLE
        \alpha α  \Gamma Γ
        \rightarrow →  \Leftarrow ⇐ 
        \oplus ⊕  \int ∫
        x_3 x₃  v^x vˣ
        #+END_EXAMPLE
      - greek-babel αΑ Γγ η 
        #+BEGIN_EXAMPLE
        Αα Ββ Γγ Δδ Εε Ζζ  Ηη Θθ Ιι Κκ Λλ Μμ 
        Aa Bb Gg Dd Ee Zz  Hh Jj Ii Kk Ll Mm 
      
        Νν Ξξ Οο Ππ Ρρ Σσς Ττ Υυ Φφ Χχ Ψψ Ωω
        Nn Xx Oo Pp Rr Ssc Tt Uu Ff Qq Yy Ww
      #+END_EXAMPLE
- 使用操作系统的 输入法 或 其它工具 
- Abbrev mode
  - zhw -> hello world hello world 
- 补全 
  - [[https://company-mode.github.io/][company]]
  - [[https://github.com/auto-complete/auto-complete][auto-complete]]
  - [[https://github.com/joaotavora/yasnippet][yasnippet]]
    - yas-insert-snippet == s-i
- 来源 : 文件 | 其它缓冲
  - C-x i == insert-file
  - insert-buffer
** 删除 剪切 复制 粘贴
- 删除(delete) | 剪切(kill)
  - 区别 : kill 会把kill掉内容放到 kill ring 里
  - 字符|词 - 左|右
    - delete-backward-char == <Del>
    - delete-char == C-d
    - ---
    - backward-kill-word == (C|M)-<Del>
    - kill-word == M-d 
  - 行 - 右|左|整行
    - 右: kill-line == C-k
    - 左: M-0 C-k
    - 整: kill-whole-line  (-> [[https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el][whole-line-or-region]] == C-w)
  - 句
    - kill-sentence == M-k
    - backward-kill-sentence == C-x <DEL>
  - 区域
    - kill-region == C-w  (-> [[https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el][whole-line-or-region]])
- 复制-区域 
  - kill-ring-save == M-w (-> [[https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el][whole-line-or-region]])
- 粘贴 (从 Kill ring (剪切环))
  - 最近一个: yank == C-y
  - yank-pop == M-y
  - 指定位置: (C-u|M-) [Num] C-y

Special
- 表达式 (exp) "exp" exp
  - C-M-k == kill-sexp

Assist
- Kill Ring :  [[https://github.com/emacs-helm/helm][Helm]]
  - helm-show-kill-ring == M-y
- [[https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el][whole-line-or-region]] [[whole line or region][config]] : 区域激活 则应用到区域 否则 应用到当前行
- Copy Kill Move(Kill-[Goto]-Paste)
  - [[https://github.com/wyuenho/move-dup][move-dup]] (行|区域)
    - md/move-lines-[up|down]
    - md/duplicate-[up|down]
  - [[https://github.com/abo-abo/avy][Avy]]
    - avy-copy-[line|region] (单行|行范围)
    - avy-kill-[line|region]
    - avy-move-[line|region]
- 到字符之前
  - 右: M-z [char] == zap-to-char
  - 左: M-- M-z
- 连续-空格
  - delete-horizontal-space == M-\
- 空白行 (位置相关: 一个到无 | 多个到一个 | 跟随的全部)
  - delete-blank-lines == C-x C-o
- 重复行
  - delete-duplicate-lines  (keeps first)
    - C-u : keeps last
    - C-u C-u : only adjacent lines (邻近)
    - C-u C-u C-u : retains repeated blank lines
