articles/emacs-note.html

<div id="outline-container-orga8ab30b" class="outline-2">
<h2 id="orga8ab30b"><span class="section-number-2">6</span> Move 移动 &amp; Jump 跳转</h2>
<div class="outline-text-2" id="text-6">
<p>
光标的定位 (屏幕可视范围内)
</p>

<p>
Buffer
</p>
<ul class="org-ul">
<li>左右
<ul class="org-ul">
<li>C-b|f == (backward|forward)-char</li>
<li>M-b|f == (backward|forward)-word</li>
</ul></li>
<li>上|下
<ul class="org-ul">
<li>C-p|n == (previous|next)-line</li>
</ul></li>
<li>行-首|尾
<ul class="org-ul">
<li>C-a|e == (beginning|end)-of-line</li>
</ul></li>
<li>句子-首|尾
<ul class="org-ul">
<li>M-a|e == (backward|forward)-sentence</li>
</ul></li>
<li>段落-首|尾
<ul class="org-ul">
<li>M-{|} == (backward|forward)-paragraph</li>
</ul></li>
<li>翻页-上|下
<ul class="org-ul">
<li>M|C-v == PgUp|PgDn | scroll-(up|down)-command</li>
</ul></li>
<li>缓冲区-首|尾
<ul class="org-ul">
<li>M-&lt;|&gt; == (beginning|end)-of-buffer</li>
</ul></li>
<li>到本行第一个非空字符
<ul class="org-ul">
<li>M-m == back-to-indentation</li>
</ul></li>
<li>N-行
<ul class="org-ul">
<li>M-g (g|M-g) == goto-line</li>
</ul></li>
<li>当前缓冲区可视区域-(Top|Center|Bottom)
<ul class="org-ul">
<li>M-r == move-to-window-line-top-bottom</li>
</ul></li>
</ul>

<p>
Window  
</p>
<ul class="org-ul">
<li>C-x o == other-window</li>
</ul>

<p>
Frame
</p>
<ul class="org-ul">
<li>M-x select-frame-by-name</li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li>Wind Move
<ul class="org-ul">
<li>M-x windmove-(left|right|up|down)</li>
</ul></li>
<li><a href="https://github.com/abo-abo/ace-window">Ace Window</a>
<ul class="org-ul">
<li>M-x ace-window (Me: == S-o)</li>
</ul></li>
<li><a href="https://github.com/abo-abo/avy">Avy</a>
<ul class="org-ul">
<li>M-x avy-goto-(char|word-1|line)</li>
</ul></li>
</ul>

<p>
Supplement
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">&#35774;&#32622; sentence-end &#21487;&#20197;&#35782;&#21035;&#20013;&#25991;&#26631;&#28857;</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">setq</span> sentence-end
      <span style="color: #61CE3C;">"</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">(</span><span style="color: #61CE3C;">[&#12290;&#65281;&#65311;]</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">|</span><span style="color: #61CE3C;">&#8230;&#8230;</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">|</span><span style="color: #61CE3C;">[.?!][]\"')}]*</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">(</span><span style="color: #61CE3C;">$</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">|</span><span style="color: #61CE3C;">[ \t]</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">)</span><span style="color: #E9C062;">\\</span><span style="color: #ff0000;">)</span><span style="color: #61CE3C;">[ \t\n]*"</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce22d77" class="outline-2">
<h2 id="orgce22d77"><span class="section-number-2">7</span> Edit 编辑</h2>
<div class="outline-text-2" id="text-7">
<ul class="org-ul">
<li>选中 (标记) : 选择需要编辑的部分文本</li>
<li>插入</li>
<li>删除 剪切 复制 粘贴</li>
<li>撤销 重做</li>
<li>处理 : 执行一些特定的功能 如 转换大小写</li>
<li>特性 : 矩形区块</li>
</ul>
</div>

<div id="outline-container-org19f378f" class="outline-3">
<h3 id="org19f378f"><span class="section-number-3">7.1</span> Mark 标记</h3>
<div class="outline-text-3" id="text-7-1">
<p>
选中 需要编辑的部分文本
</p>

<ul class="org-ul">
<li>标记
<ul class="org-ul">
<li>点
<ul class="org-ul">
<li>C-(&lt;SPC&gt;|@) == set-mark-command (激活)</li>
<li>C-&lt;SPC&gt; C-&lt;SPC&gt; (不激活 但进入标记环)</li>
</ul></li>
<li>段落
<ul class="org-ul">
<li>M-h == mark-paragraph</li>
</ul></li>
<li>缓冲区
<ul class="org-ul">
<li>C-x h == mark-whole-buffer</li>
</ul></li>
<li>Mouse shift-selection
<ul class="org-ul">
<li>Shift-&lt;Mouse&gt;</li>
</ul></li>
</ul></li>
<li>标记环 (Mark Ring : 标记的点 进入 标记环) [Global|Local]
<ul class="org-ul">
<li>最后标记点
<ul class="org-ul">
<li>C-u C-&lt;SPC&gt; (当前缓冲)</li>
<li>C-x C-&lt;SPC&gt; == pop-global-mark</li>
</ul></li>
<li>列表</li>
</ul></li>
<li>互换位置-插入点和标记点
<ul class="org-ul">
<li>C-x C-x == exchange-point-and-mark</li>
</ul></li>
</ul>

<p>
Special
</p>
<ul class="org-ul">
<li>标记 表达式 
<ul class="org-ul">
<li>C-M-@ == mark-sexp</li>
</ul></li>
<li>标记 定义
<ul class="org-ul">
<li>C-M-h == mark-defun</li>
</ul></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li>标记环列表: <a href="https://github.com/emacs-helm/helm">Helm</a>
<ul class="org-ul">
<li>M-x helm-mark-all-rings | helm-[global]-mark-ring</li>
</ul></li>
<li><a href="https://github.com/magnars/expand-region.el">expand-region</a> : er/expand-region <code>= C-</code></li>
</ul>

<p>
Supplement
</p>
<ul class="org-ul">
<li><p>
整行
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">defun</span> <span style="color: #ff1493;">xt3/sel-cur-line</span> <span style="color: #006400;">()</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">interactive</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>set-mark <span style="color: #ff1493;">(</span>line-end-position<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>beginning-of-line<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">bind-key</span> <span style="color: #61CE3C;">"C-x M-h"</span> #'xt3/sel-cur-line<span style="color: #8b0000;">)</span>
</pre>
</div></li>
</ul>
</div>
</div>
<div id="outline-container-orgf9710c6" class="outline-3">
<h3 id="orgf9710c6"><span class="section-number-3">7.2</span> Insert 插入</h3>
<div class="outline-text-3" id="text-7-2">
<p>
Input 输入
</p>
<ul class="org-ul">
<li>可见的(图形字符) : a..z , 1..0, !..?</li>
<li>控制字符 : &lt;SPC&gt;, &lt;RET&gt;, &lt;TAB&gt;, &lt;DEL&gt;, &lt;ESC&gt;, &lt;F1&gt;, &lt;Home&gt;, &lt;LEFT&gt;
<ul class="org-ul">
<li>插入空白行 : &lt;RET&gt; | C-j | C-o</li>
</ul></li>
<li>修饰键 : &lt;Control&gt;, &lt;META&gt;</li>
<li>输入 对应 命令</li>
<li>非键盘 : mouse(鼠标) (一般作为定位 特殊模式 拖拽绘制字符)</li>
<li>引用插入
<ul class="org-ul">
<li>C-q == quoted-insert</li>
<li>不可见(非图形字符)
<ul class="org-ul">
<li>&lt;Ret&gt;, C-l(分页符)</li>
<li>033 Enter (Ascii 八进制) = f</li>
</ul></li>
</ul></li>
<li>Unicode
<ul class="org-ul">
<li>C-x 8 RET</li>
<li>速记 : C-x 8 C-h £</li>
<li>∑ (2211) ⤶ (2936)</li>
</ul></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li>Input Method 输入法
<ul class="org-ul">
<li>内置
<ul class="org-ul">
<li>触发 : toggle-input-medthod == C-\</li>
<li>切换 : select-input-medthod == C-u C-\ | C-x Ret C-\</li>
<li>示例 :
<ul class="org-ul">
<li><p>
Tex α x₃ X³
</p>
<pre class="example">
        \alpha α  \Gamma Γ
        \rightarrow →  \Leftarrow ⇐ 
        \oplus ⊕  \int ∫
        x_3 x₃  v^x vˣ
</pre></li>
<li><p>
greek-babel αΑ Γγ η 
</p>
<pre class="example">
        Αα Ββ Γγ Δδ Εε Ζζ  Ηη Θθ Ιι Κκ Λλ Μμ 
        Aa Bb Gg Dd Ee Zz  Hh Jj Ii Kk Ll Mm 
      
        Νν Ξξ Οο Ππ Ρρ Σσς Ττ Υυ Φφ Χχ Ψψ Ωω
        Nn Xx Oo Pp Rr Ssc Tt Uu Ff Qq Yy Ww
</pre></li>
</ul></li>
</ul></li>
</ul></li>
<li>使用操作系统的 输入法 或 其它工具</li>
<li>Abbrev mode
<ul class="org-ul">
<li>zhw -&gt; hello world hello world</li>
</ul></li>
<li>补全 
<ul class="org-ul">
<li><a href="https://company-mode.github.io/">company</a></li>
<li><a href="https://github.com/auto-complete/auto-complete">auto-complete</a></li>
<li><a href="https://github.com/joaotavora/yasnippet">yasnippet</a>
<ul class="org-ul">
<li>yas-insert-snippet == s-i</li>
</ul></li>
</ul></li>
<li>来源 : 文件 | 其它缓冲
<ul class="org-ul">
<li>C-x i == insert-file</li>
<li>insert-buffer</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgff39381" class="outline-3">
<h3 id="orgff39381"><span class="section-number-3">7.3</span> 删除 剪切 复制 粘贴</h3>
<div class="outline-text-3" id="text-7-3">
<ul class="org-ul">
<li>删除(delete) | 剪切(kill)
<ul class="org-ul">
<li>区别 : kill 会把kill掉内容放到 kill ring 里</li>
<li>字符|词 - 左|右
<ul class="org-ul">
<li>delete-backward-char == &lt;Del&gt;</li>
<li>delete-char == C-d</li>
<li>&#x2014;</li>
<li>backward-kill-word == (C|M)-&lt;Del&gt;</li>
<li>kill-word == M-d</li>
</ul></li>
<li>行 - 右|左|整行
<ul class="org-ul">
<li>右: kill-line == C-k</li>
<li>左: M-0 C-k</li>
<li>整: kill-whole-line  (-&gt; <a href="https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el">whole-line-or-region</a> == C-w)</li>
</ul></li>
<li>句
<ul class="org-ul">
<li>kill-sentence == M-k</li>
<li>backward-kill-sentence == C-x &lt;DEL&gt;</li>
</ul></li>
<li>区域
<ul class="org-ul">
<li>kill-region == C-w  (-&gt; <a href="https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el">whole-line-or-region</a>)</li>
</ul></li>
</ul></li>
<li>复制-区域 
<ul class="org-ul">
<li>kill-ring-save == M-w (-&gt; <a href="https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el">whole-line-or-region</a>)</li>
</ul></li>
<li>粘贴 (从 Kill ring (剪切环))
<ul class="org-ul">
<li>最近一个: yank == C-y</li>
<li>yank-pop == M-y</li>
<li>指定位置: (C-u|M-) [Num] C-y</li>
</ul></li>
</ul>

<p>
Special
</p>
<ul class="org-ul">
<li>表达式 (exp) "exp" exp
<ul class="org-ul">
<li>C-M-k == kill-sexp</li>
</ul></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li>Kill Ring :  <a href="https://github.com/emacs-helm/helm">Helm</a>
<ul class="org-ul">
<li>helm-show-kill-ring == M-y</li>
</ul></li>
<li><a href="https://github.com/purcell/whole-line-or-region/blob/master/whole-line-or-region.el">whole-line-or-region</a> <a href="#orgda39039">config</a> : 区域激活 则应用到区域 否则 应用到当前行</li>
<li>Copy Kill Move(Kill-[Goto]-Paste)
<ul class="org-ul">
<li><a href="https://github.com/wyuenho/move-dup">move-dup</a> (行|区域)
<ul class="org-ul">
<li>md/move-lines-[up|down]</li>
<li>md/duplicate-[up|down]</li>
</ul></li>
<li><a href="https://github.com/abo-abo/avy">Avy</a>
<ul class="org-ul">
<li>avy-copy-[line|region] (单行|行范围)</li>
<li>avy-kill-[line|region]</li>
<li>avy-move-[line|region]</li>
</ul></li>
</ul></li>
<li>到字符之前
<ul class="org-ul">
<li>右: M-z [char] == zap-to-char</li>
<li>左: M&#x2013; M-z</li>
</ul></li>
<li>连续-空格
<ul class="org-ul">
<li>delete-horizontal-space == M-\</li>
</ul></li>
<li>空白行 (位置相关: 一个到无 | 多个到一个 | 跟随的全部)
<ul class="org-ul">
<li>delete-blank-lines == C-x C-o</li>
</ul></li>
<li>重复行
<ul class="org-ul">
<li>delete-duplicate-lines  (keeps first)
<ul class="org-ul">
<li>C-u : keeps last</li>
<li>C-u C-u : only adjacent lines (邻近)</li>
<li>C-u C-u C-u : retains repeated blank lines</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
