articles/emacs-note.org
** Undo/Redo 撤销 重做
- 撤销/重做
  - Undo: undo == C-/
  - Redo: C-u C-/

Assist
- [[http://www.emacswiki.org/emacs/UndoTree][undo-tree]] [[Undo Tree][config]]
  - undo-tree-visualize == C-x u
  - Undo: undo-tree-undo == C-/
  - Redo: undo-tree-redo == C-?

** Multiple 多重
- rectangle 矩形区块
  - 插入
    - 空格: open-rectangle == C-x r o
    - 字符串: M-x string-insert-rectangle
    - 行号: rectangle-number-lines == C-x r N
      - C-u : set start number and format
  - 替代
    - 空格: clear-rectangle == C-x r c
    - 字符串: string-rectangle == C-x r t
  - 删除
    - delete-rectangle == C-x r d
    - 空格: M-x delete-whitespace-rectangle
  - 剪切 | 复制 | 粘贴
    - C-x r k == kill-rectangle
    - C-x r M-w == copy-rectangle-as-kill
    - C-x r y == yank-rectangle
- [[Keyboard Macro 键盘宏][Keyboard Macro 键盘宏]]
 
Assist
- [[https://github.com/magnars/multiple-cursors.el][Multiple cursors]] [[Mutiple cursors][config]] [[hydra mc][kbd]]

** Other 其它
- 缩进    
  - 按上一行的格式: indent-region == M-C-\ == <Tab>
  - 区域: indent-rigidly == C-x <Tab> == C-x C-i    
- 行操作
  - 开新
    - open-line == C-o
    - newline-and-maybe-indent == C-j
  - 分割
    - split-line == M-C-o
  - 连接-前|后
    - delete-indentation == M-^  (反向: C-u ..)
- 调换-前|后
  - transpose-(chars|words) == (C|M)-t
- 转换-大小写
  - (capitalize|uppercase|downcase)-word == M-(c|u|l) (反向: M-- ..)
  - (upcase|downcase)-region == C-x C-(u|l)
- Narrowing : 当前缓冲 进入部分编辑 不影响缓冲其它部分 
  - 进入: narrow-to-(region|page|defun) == C-x n (n|p|d)
    - org-narrow-to-(subtree|block|element) == C-x n (s|b|e)
  - 退出: widen == C-x n w

*** Align 对齐
- align (align-rules-list)
- align-(current|entire|newline-and-indent)
- align-regexp (C-u ..)

Assist
- [[https://github.com/mkcms/interactive-align][ialign]]

*** Sort 排序
- 按-行|列|段|页
  - sort-(lines|columns|paragraph|pages) 
    - paragraph <- paragraph-start, paragraph-separate
    - 反序: C-u ..
- sort-numeric-fields     (base: sort-numeric-base)
- sort-fields (第几字段: C-u [N] | M-[N])
- 正则表达式 : sort-regexp-fields
  - word : (\w) \1
  - words : (\w+) \1    
- 反序
  - M-x reverse-region
- 忽略大小写 : sort-fold-case = t

* Search 搜索 & Replace 替换
Search
- isearchn (Incremental search)
  - 前|后 (重复-切换搜索到的词)
    - isearch-(forward|backward) == C-(s|r)
    - isearch-(forward|backward)-regexp == C-M-(s|r)
    - isearch-forward-(word|symbol) == M-s (w|_)
    - isearch-forward-symbol-at-point == M-s .
  - Activated (C-s ..)
    - Paste : C-y
    - History : M-n|p
    - 大小写敏感 : M-c
    - C-w  (光标处到下一个词的词尾) 
    - C-(s|r) ( 同向: 重复上一次搜索; 反向: 切换搜索方向)
    - 非增量 : RET
    - Regex : M-r
- occor
  - M-s o == occur
    - -> *Occur* buffer
    - e : occur-edit-mode : Edit current *Occur* buffer
      - exit : C-c C-c
    - next|previous : M-g (n|p)
    - repeat : C-x z
    - next|previous line : C-n|p
    - beginning|end of buffer : <|>
    - refresh : g 
    - Jump to match : o
    - Jump to match but point remainon *Occur* : C-o
    - help : h 
    - quit : q
  - multi-occur (multiple buffers)
    - M-x multi-occur		
    - M-x multi-occur-in-matching-buffers
- grep
  - M-x grep
  - Asynchronously : M-x lgrep
  - M-x grep-find | find-grep

Replace
- 所有: replace-(string|regexp)
- 问询
  - query-replace == M-%
  - query-replace-regexp == C-M-%
  - 选项
    - 退出 : <Enter>|q
    - 替换当前 : <Spc>|y
    - 替换-所有 : !
    - 跳过 : <Del>|n
    - 退回-到前一次替换 : ^
    - 替换当前 且 退出 : .
    - 替换当前 且 光标移动到此处 且 退出 : ,
    - 撤销-前一个|所有 : u|U 
    - 递归编辑 : C-r
      - 退出 : C-M-c
    - 删除-这个匹配 并 进入递归编辑 : C-w
    - 退出-递归编辑 和 问询 : C-]
    - 编辑-替换的字符串 : E


Assist
- Swiper : [[https://github.com/abo-abo/swiper][Ivy]]-Swiper [[https://github.com/abo-abo/swiper-helm][Swiper-helm]]
  - C-s ..
    - Paste : C-y | M-y(Kill Ring)
    - Next|Previous : C-(n|p)
- [[https://github.com/ShingoFukuyama/helm-swoop][helm-swoop]] == M-i
  - (M-[N] 显示周围行)
  - 多缓冲: helm-multi-swoop == C-c M-i
  - 所有缓冲: helm-multi-swoop-all
  - Edit mode : C-c C-e
- [[https://github.com/Wilfred/ag.el][Ag]] : [[https://github.com/syohex/emacs-helm-ag][helm-ag]]
- [[https://github.com/magnars/multiple-cursors.el][Multiple cursors]] [[Mutiple cursors][config]] [[hydra mc][kbd]]

Special
- imenu : helm-imenu
  - helm-semantic-or-imenu == C-c h i
- Search engines : helm-surfraw == C-c h s
  - brew install surfraw
- Project : [[http://batsov.com/projectile/][Projectile]]

* Repeat 重复
- 多次运行同一个命令
  - universal-argument == C-u [N] (缺省次数: 4)
  - digit-argument == (C|M)-[N]
  - C-u [C-u]*  (4^n)
- 上一条命令 (一次或多次)
  - repeat == C-x z ... z
- 复杂命令
  - repeat-complex-command == C-x ESC ESC | C-x M-:

Assist
- [[Keyboard Macro 键盘宏][Keyboard Macro 键盘宏]]
- [[https://github.com/magnars/multiple-cursors.el][Multiple cursors]] [[Mutiple cursors][config]] [[hydra mc][kbd]]


* Assist 辅助
** Information 信息
- 词数
  - count-words-region ~==~ M-=  (缓冲: C-u ..)
  - M-x count-words (缓冲|区域)
- 行数: M-x count-lines-region
- 字符信息
  - what-cursor-position ~==~ C-x =  (编码 第几个字符 第几列)
  - M-x describe-char  (详细信息)

** Keyboard Macro 键盘宏
- 开始|结束
  - (start|end)-kbd-macro == C-x (|) | <F3>|<F4>
  - 追加: C-u C-x (
- 执行 
  - call-last-kbd-macro == C-x e | <F4>
  - M-x (Macro Name) | helm-execute-kmacro
- 终止
  - C-g
- 命名 
  - M-x name-last-kbd-macro
