articles/emacs-note.html
<div id="outline-container-orgff96b8a" class="outline-3">
<h3 id="orgff96b8a"><span class="section-number-3">7.4</span> Undo/Redo 撤销 重做</h3>
<div class="outline-text-3" id="text-7-4">
<ul class="org-ul">
<li>撤销/重做
<ul class="org-ul">
<li>Undo: undo == C-/</li>
<li>Redo: C-u C-/</li>
</ul></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li><a href="http://www.emacswiki.org/emacs/UndoTree">undo-tree</a> <a href="#org7ab7693">config</a>
<ul class="org-ul">
<li>undo-tree-visualize == C-x u</li>
<li>Undo: undo-tree-undo == C-/</li>
<li>Redo: undo-tree-redo == C-?</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org8e229ef" class="outline-3">
<h3 id="org8e229ef"><span class="section-number-3">7.5</span> Multiple 多重</h3>
<div class="outline-text-3" id="text-7-5">
<ul class="org-ul">
<li>rectangle 矩形区块
<ul class="org-ul">
<li>插入
<ul class="org-ul">
<li>空格: open-rectangle == C-x r o</li>
<li>字符串: M-x string-insert-rectangle</li>
<li>行号: rectangle-number-lines == C-x r N
<ul class="org-ul">
<li>C-u : set start number and format</li>
</ul></li>
</ul></li>
<li>替代
<ul class="org-ul">
<li>空格: clear-rectangle == C-x r c</li>
<li>字符串: string-rectangle == C-x r t</li>
</ul></li>
<li>删除
<ul class="org-ul">
<li>delete-rectangle == C-x r d</li>
<li>空格: M-x delete-whitespace-rectangle</li>
</ul></li>
<li>剪切 | 复制 | 粘贴
<ul class="org-ul">
<li>C-x r k == kill-rectangle</li>
<li>C-x r M-w == copy-rectangle-as-kill</li>
<li>C-x r y == yank-rectangle</li>
</ul></li>
</ul></li>
<li><a href="#orgff26de5">Keyboard Macro 键盘宏</a></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li><a href="https://github.com/magnars/multiple-cursors.el">Multiple cursors</a> <a href="#org9af7374">config</a> <a href="#orgba2f9d0">kbd</a></li>
</ul>
</div>
</div>

<div id="outline-container-org557a4dc" class="outline-3">
<h3 id="org557a4dc"><span class="section-number-3">7.6</span> Other 其它</h3>
<div class="outline-text-3" id="text-7-6">
<ul class="org-ul">
<li>缩进    
<ul class="org-ul">
<li>按上一行的格式: indent-region <code>= M-C-\ =</code> &lt;Tab&gt;</li>
<li>区域: indent-rigidly <code>= C-x &lt;Tab&gt; =</code> C-x C-i</li>
</ul></li>
<li>行操作
<ul class="org-ul">
<li>开新
<ul class="org-ul">
<li>open-line == C-o</li>
<li>newline-and-maybe-indent == C-j</li>
</ul></li>
<li>分割
<ul class="org-ul">
<li>split-line == M-C-o</li>
</ul></li>
<li>连接-前|后
<ul class="org-ul">
<li>delete-indentation == M-^  (反向: C-u ..)</li>
</ul></li>
</ul></li>
<li>调换-前|后
<ul class="org-ul">
<li>transpose-(chars|words) == (C|M)-t</li>
</ul></li>
<li>转换-大小写
<ul class="org-ul">
<li>(capitalize|uppercase|downcase)-word == M-(c|u|l) (反向: M&#x2013; ..)</li>
<li>(upcase|downcase)-region == C-x C-(u|l)</li>
</ul></li>
<li>Narrowing : 当前缓冲 进入部分编辑 不影响缓冲其它部分 
<ul class="org-ul">
<li>进入: narrow-to-(region|page|defun) == C-x n (n|p|d)
<ul class="org-ul">
<li>org-narrow-to-(subtree|block|element) == C-x n (s|b|e)</li>
</ul></li>
<li>退出: widen == C-x n w</li>
</ul></li>
</ul>
</div>

<div id="outline-container-org54cebf1" class="outline-4">
<h4 id="org54cebf1"><span class="section-number-4">7.6.1</span> Align 对齐</h4>
<div class="outline-text-4" id="text-7-6-1">
<ul class="org-ul">
<li>align (align-rules-list)</li>
<li>align-(current|entire|newline-and-indent)</li>
<li>align-regexp (C-u ..)</li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li><a href="https://github.com/mkcms/interactive-align">ialign</a></li>
</ul>
</div>
</div>

<div id="outline-container-org1a2ed62" class="outline-4">
<h4 id="org1a2ed62"><span class="section-number-4">7.6.2</span> Sort 排序</h4>
<div class="outline-text-4" id="text-7-6-2">
<ul class="org-ul">
<li>按-行|列|段|页
<ul class="org-ul">
<li>sort-(lines|columns|paragraph|pages) 
<ul class="org-ul">
<li>paragraph &lt;- paragraph-start, paragraph-separate</li>
<li>反序: C-u ..</li>
</ul></li>
</ul></li>
<li>sort-numeric-fields     (base: sort-numeric-base)</li>
<li>sort-fields (第几字段: C-u [N] | M-[N])</li>
<li>正则表达式 : sort-regexp-fields
<ul class="org-ul">
<li>word : () \1</li>
<li>words : (+) \1</li>
</ul></li>
<li>反序
<ul class="org-ul">
<li>M-x reverse-region</li>
</ul></li>
<li>忽略大小写 : sort-fold-case = t</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org60f8c03" class="outline-2">
<h2 id="org60f8c03"><span class="section-number-2">8</span> Search 搜索 &amp; Replace 替换</h2>
<div class="outline-text-2" id="text-8">
<p>
Search
</p>
<ul class="org-ul">
<li>isearchn (Incremental search)
<ul class="org-ul">
<li>前|后 (重复-切换搜索到的词)
<ul class="org-ul">
<li>isearch-(forward|backward) == C-(s|r)</li>
<li>isearch-(forward|backward)-regexp == C-M-(s|r)</li>
<li>isearch-forward-(word|symbol) == M-s (w|_)</li>
<li>isearch-forward-symbol-at-point == M-s .</li>
</ul></li>
<li>Activated (C-s ..)
<ul class="org-ul">
<li>Paste : C-y</li>
<li>History : M-n|p</li>
<li>大小写敏感 : M-c</li>
<li>C-w  (光标处到下一个词的词尾)</li>
<li>C-(s|r) ( 同向: 重复上一次搜索; 反向: 切换搜索方向)</li>
<li>非增量 : RET</li>
<li>Regex : M-r</li>
</ul></li>
</ul></li>
<li>occor
<ul class="org-ul">
<li>M-s o == occur
<ul class="org-ul">
<li>-&gt; <b>Occur</b> buffer</li>
<li>e : occur-edit-mode : Edit current <b>Occur</b> buffer
<ul class="org-ul">
<li>exit : C-c C-c</li>
</ul></li>
<li>next|previous : M-g (n|p)</li>
<li>repeat : C-x z</li>
<li>next|previous line : C-n|p</li>
<li>beginning|end of buffer : &lt;|&gt;</li>
<li>refresh : g</li>
<li>Jump to match : o</li>
<li>Jump to match but point remainon <b>Occur</b> : C-o</li>
<li>help : h</li>
<li>quit : q</li>
</ul></li>
<li>multi-occur (multiple buffers)
<ul class="org-ul">
<li>M-x multi-occur</li>
<li>M-x multi-occur-in-matching-buffers</li>
</ul></li>
</ul></li>
<li>grep
<ul class="org-ul">
<li>M-x grep</li>
<li>Asynchronously : M-x lgrep</li>
<li>M-x grep-find | find-grep</li>
</ul></li>
</ul>

<p>
Replace
</p>
<ul class="org-ul">
<li>所有: replace-(string|regexp)</li>
<li>问询
<ul class="org-ul">
<li>query-replace == M-%</li>
<li>query-replace-regexp == C-M-%</li>
<li>选项
<ul class="org-ul">
<li>退出 : &lt;Enter&gt;|q</li>
<li>替换当前 : &lt;Spc&gt;|y</li>
<li>替换-所有 : !</li>
<li>跳过 : &lt;Del&gt;|n</li>
<li>退回-到前一次替换 : ^</li>
<li>替换当前 且 退出 : .</li>
<li>替换当前 且 光标移动到此处 且 退出 : ,</li>
<li>撤销-前一个|所有 : u|U</li>
<li>递归编辑 : C-r
<ul class="org-ul">
<li>退出 : C-M-c</li>
</ul></li>
<li>删除-这个匹配 并 进入递归编辑 : C-w</li>
<li>退出-递归编辑 和 问询 : C-]</li>
<li>编辑-替换的字符串 : E</li>
</ul></li>
</ul></li>
</ul>


<p>
Assist
</p>
<ul class="org-ul">
<li>Swiper : <a href="https://github.com/abo-abo/swiper">Ivy</a>-Swiper <a href="https://github.com/abo-abo/swiper-helm">Swiper-helm</a>
<ul class="org-ul">
<li>C-s ..
<ul class="org-ul">
<li>Paste : C-y | M-y(Kill Ring)</li>
<li>Next|Previous : C-(n|p)</li>
</ul></li>
</ul></li>
<li><a href="https://github.com/ShingoFukuyama/helm-swoop">helm-swoop</a> == M-i
<ul class="org-ul">
<li>(M-[N] 显示周围行)</li>
<li>多缓冲: helm-multi-swoop == C-c M-i</li>
<li>所有缓冲: helm-multi-swoop-all</li>
<li>Edit mode : C-c C-e</li>
</ul></li>
<li><a href="https://github.com/Wilfred/ag.el">Ag</a> : <a href="https://github.com/syohex/emacs-helm-ag">helm-ag</a></li>
<li><a href="https://github.com/magnars/multiple-cursors.el">Multiple cursors</a> <a href="#org9af7374">config</a> <a href="#orgba2f9d0">kbd</a></li>
</ul>

<p>
Special
</p>
<ul class="org-ul">
<li>imenu : helm-imenu
<ul class="org-ul">
<li>helm-semantic-or-imenu == C-c h i</li>
</ul></li>
<li>Search engines : helm-surfraw == C-c h s
<ul class="org-ul">
<li>brew install surfraw</li>
</ul></li>
<li>Project : <a href="http://batsov.com/projectile/">Projectile</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf245fe1" class="outline-2">
<h2 id="orgf245fe1"><span class="section-number-2">9</span> Repeat 重复</h2>
<div class="outline-text-2" id="text-9">
<ul class="org-ul">
<li>多次运行同一个命令
<ul class="org-ul">
<li>universal-argument == C-u [N] (缺省次数: 4)</li>
<li>digit-argument == (C|M)-[N]</li>
<li>C-u [C-u]*  (4<sup>n</sup>)</li>
</ul></li>
<li>上一条命令 (一次或多次)
<ul class="org-ul">
<li>repeat == C-x z &#x2026; z</li>
</ul></li>
<li>复杂命令
<ul class="org-ul">
<li>repeat-complex-command == C-x ESC ESC | C-x M-:</li>
</ul></li>
</ul>

<p>
Assist
</p>
<ul class="org-ul">
<li><a href="#orgff26de5">Keyboard Macro 键盘宏</a></li>
<li><a href="https://github.com/magnars/multiple-cursors.el">Multiple cursors</a> <a href="#org9af7374">config</a> <a href="#orgba2f9d0">kbd</a></li>
</ul>
</div>
</div>


<div id="outline-container-org87f3f52" class="outline-2">
<h2 id="org87f3f52"><span class="section-number-2">10</span> Assist 辅助</h2>
<div class="outline-text-2" id="text-10">
</div><div id="outline-container-orgd9a18ac" class="outline-3">
<h3 id="orgd9a18ac"><span class="section-number-3">10.1</span> Information 信息</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>词数
<ul class="org-ul">
<li>count-words-region <code>==</code> M-=  (缓冲: C-u ..)</li>
<li>M-x count-words (缓冲|区域)</li>
</ul></li>
<li>行数: M-x count-lines-region</li>
<li>字符信息
<ul class="org-ul">
<li>what-cursor-position <code>==</code> C-x =  (编码 第几个字符 第几列)</li>
<li>M-x describe-char  (详细信息)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgff26de5" class="outline-3">
<h3 id="orgff26de5"><span class="section-number-3">10.2</span> Keyboard Macro 键盘宏</h3>
<div class="outline-text-3" id="text-10-2">
<ul class="org-ul">
<li>开始|结束
<ul class="org-ul">
<li>(start|end)-kbd-macro == C-x (|) | &lt;F3&gt;|&lt;F4&gt;</li>
<li>追加: C-u C-x (</li>
</ul></li>
<li>执行 
<ul class="org-ul">
<li>call-last-kbd-macro == C-x e | &lt;F4&gt;</li>
<li>M-x (Macro Name) | helm-execute-kmacro</li>
</ul></li>
<li>终止
<ul class="org-ul">
<li>C-g</li>
</ul></li>
<li>命名 
<ul class="org-ul">
<li>M-x name-last-kbd-macro</li>
</ul></li>
</ul>
</div>
</div>
