articles/emacs-note.org
** Abbrev 缩写
- 添加
  - 全局: add-global-abbrev == C-x a g
  - 当前主要模式: C-x a l == add-mode-abbrev
  - inverse-add-(global|mode)-abbrev == C-x a i (g|l)
  - M-x define-(global|mode)-abbrev
  - 前缀
    - 0 : region as expansion
    - C-u [N] : N words
- 删除
  - Arg: C-u -
  - 全部: M-x kill-all-abbrevs
- 扩展
  - abbrev-prefix-mark == M-'  (Ex. cnst -expands-into-> construction)
  - expand-abbrev == C-x a e 
  - M-x expand-region-abbrevs
  - M-x unexpand-abbrev
- 查看和编辑
  - M-x list-abbrevs (C-u [N] .. : local, N:次数)
  - M-x edit-abbrevs
- 保存
  - M-x write-abbrev-file <RET> file <RET>
  - M-x read-abbrev-file <RET> file <RET>
  - M-x define-abbrevs
  - M-x insert-abbrevs

** Register 寄存器
- 寄存器 : 存储 文本 矩形区块 位置 值 设置
- View
  - M-x view-register <RET>
- Jump
  - jump-to-register == C-x r j
- Position
  - Save: point-to-register == C-x r <SPC>
- Text|Rectangle
  - Save: copy-[rectangle]-to-register == C-x r (s|r)  (C-u .. : copy-to and del)
  - Insert: insert-register == C-x r i
- Text
  - Append: M-x append-to-register <RET>
    - increment-register == C-x r +
  - Prepend: M-x prepend-to-register <RET>
- Frame&Window Configuration
  - Save
    - window-configuration-to-register == C-x r w
    - frameset-to-register == C-x r f
  - Restore: C-x r j  (C-u .. : del frame invisible)
- Number
  - Save: number-to-register ==  C-u [N] C-x r n
  - Increment: C-u [N] C-x r +
  - Insert: insert-register == C-x r i
- Keyboard Macro
  - Save: kmacro-to-register ==  C-x C-k x
  - Exe: C-x r j
** Bookmark 书签
- 书签 : 保存缓冲区中位置
- 设置-光标位置
  - bookmark-set == C-x r m
  - bookmark-set-no-overwrite == C-x r M
- 移动到-指示的位置
  - bookmark-jump == C-x r b
- 显示-书签列表
  - list-bookmarks == C-x r l
- 删除
  - M-x bookmark-delete
- 重命名
  - M-x bookmark-rename
- 保存 加载
  - 到默认文件: bookmark-save
  - 新文件: bookmark-write
  - 加载: bookmark-load
- 插入
  - 文件内容: bookmark-insert
  - 文件名字: bookmark-insert-location
** Other
Highlight 高亮
- 光标所在行
  - hl-line-mode (当前缓冲)  [[Highlight Line][config]]

自动加载外部修改过的文件
- global-auto-revert-mode

Key bindings
- [[https://github.com/kai2nenobu/guide-key][guide-key]]

* Special Mode
** Dired
** Org
** Shell
** Git
- [[http://magit.github.io/][Magit]]

* Programming
** C
** Lisp
* hydra
聚合功能 更方便输入 并且 辅助记忆差 手速低 的我

