articles/emacs-note.html
<div id="outline-container-org97a2b18" class="outline-3">
<h3 id="org97a2b18"><span class="section-number-3">10.3</span> Abbrev 缩写</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li>添加
<ul class="org-ul">
<li>全局: add-global-abbrev == C-x a g</li>
<li>当前主要模式: C-x a l == add-mode-abbrev</li>
<li>inverse-add-(global|mode)-abbrev == C-x a i (g|l)</li>
<li>M-x define-(global|mode)-abbrev</li>
<li>前缀
<ul class="org-ul">
<li>0 : region as expansion</li>
<li>C-u [N] : N words</li>
</ul></li>
</ul></li>
<li>删除
<ul class="org-ul">
<li>Arg: C-u -</li>
<li>全部: M-x kill-all-abbrevs</li>
</ul></li>
<li>扩展
<ul class="org-ul">
<li>abbrev-prefix-mark == M-'  (Ex. cnst -expands-into-&gt; construction)</li>
<li>expand-abbrev == C-x a e</li>
<li>M-x expand-region-abbrevs</li>
<li>M-x unexpand-abbrev</li>
</ul></li>
<li>查看和编辑
<ul class="org-ul">
<li>M-x list-abbrevs (C-u [N] .. : local, N:次数)</li>
<li>M-x edit-abbrevs</li>
</ul></li>
<li>保存
<ul class="org-ul">
<li>M-x write-abbrev-file &lt;RET&gt; file &lt;RET&gt;</li>
<li>M-x read-abbrev-file &lt;RET&gt; file &lt;RET&gt;</li>
<li>M-x define-abbrevs</li>
<li>M-x insert-abbrevs</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfee0a85" class="outline-3">
<h3 id="orgfee0a85"><span class="section-number-3">10.4</span> Register 寄存器</h3>
<div class="outline-text-3" id="text-10-4">
<ul class="org-ul">
<li>寄存器 : 存储 文本 矩形区块 位置 值 设置</li>
<li>View
<ul class="org-ul">
<li>M-x view-register &lt;RET&gt;</li>
</ul></li>
<li>Jump
<ul class="org-ul">
<li>jump-to-register == C-x r j</li>
</ul></li>
<li>Position
<ul class="org-ul">
<li>Save: point-to-register == C-x r &lt;SPC&gt;</li>
</ul></li>
<li>Text|Rectangle
<ul class="org-ul">
<li>Save: copy-[rectangle]-to-register == C-x r (s|r)  (C-u .. : copy-to and del)</li>
<li>Insert: insert-register == C-x r i</li>
</ul></li>
<li>Text
<ul class="org-ul">
<li>Append: M-x append-to-register &lt;RET&gt;
<ul class="org-ul">
<li>increment-register == C-x r +</li>
</ul></li>
<li>Prepend: M-x prepend-to-register &lt;RET&gt;</li>
</ul></li>
<li>Frame&amp;Window Configuration
<ul class="org-ul">
<li>Save
<ul class="org-ul">
<li>window-configuration-to-register == C-x r w</li>
<li>frameset-to-register == C-x r f</li>
</ul></li>
<li>Restore: C-x r j  (C-u .. : del frame invisible)</li>
</ul></li>
<li>Number
<ul class="org-ul">
<li>Save: number-to-register ==  C-u [N] C-x r n</li>
<li>Increment: C-u [N] C-x r +</li>
<li>Insert: insert-register == C-x r i</li>
</ul></li>
<li>Keyboard Macro
<ul class="org-ul">
<li>Save: kmacro-to-register ==  C-x C-k x</li>
<li>Exe: C-x r j</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgd89a39d" class="outline-3">
<h3 id="orgd89a39d"><span class="section-number-3">10.5</span> Bookmark 书签</h3>
<div class="outline-text-3" id="text-10-5">
<ul class="org-ul">
<li>书签 : 保存缓冲区中位置</li>
<li>设置-光标位置
<ul class="org-ul">
<li>bookmark-set == C-x r m</li>
<li>bookmark-set-no-overwrite == C-x r M</li>
</ul></li>
<li>移动到-指示的位置
<ul class="org-ul">
<li>bookmark-jump == C-x r b</li>
</ul></li>
<li>显示-书签列表
<ul class="org-ul">
<li>list-bookmarks == C-x r l</li>
</ul></li>
<li>删除
<ul class="org-ul">
<li>M-x bookmark-delete</li>
</ul></li>
<li>重命名
<ul class="org-ul">
<li>M-x bookmark-rename</li>
</ul></li>
<li>保存 加载
<ul class="org-ul">
<li>到默认文件: bookmark-save</li>
<li>新文件: bookmark-write</li>
<li>加载: bookmark-load</li>
</ul></li>
<li>插入
<ul class="org-ul">
<li>文件内容: bookmark-insert</li>
<li>文件名字: bookmark-insert-location</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orga1899e6" class="outline-3">
<h3 id="orga1899e6"><span class="section-number-3">10.6</span> Other</h3>
<div class="outline-text-3" id="text-10-6">
<p>
Highlight 高亮
</p>
<ul class="org-ul">
<li>光标所在行
<ul class="org-ul">
<li>hl-line-mode (当前缓冲)  <a href="#orgd97d13c">config</a></li>
</ul></li>
</ul>

<p>
自动加载外部修改过的文件
</p>
<ul class="org-ul">
<li>global-auto-revert-mode</li>
</ul>

<p>
Key bindings
</p>
<ul class="org-ul">
<li><a href="https://github.com/kai2nenobu/guide-key">guide-key</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org734721b" class="outline-2">
<h2 id="org734721b"><span class="section-number-2">11</span> Special Mode</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-orgdbf2df3" class="outline-3">
<h3 id="orgdbf2df3"><span class="section-number-3">11.1</span> Dired</h3>
</div>
<div id="outline-container-org633cdc3" class="outline-3">
<h3 id="org633cdc3"><span class="section-number-3">11.2</span> Org</h3>
</div>
<div id="outline-container-org5271a15" class="outline-3">
<h3 id="org5271a15"><span class="section-number-3">11.3</span> Shell</h3>
</div>
<div id="outline-container-org475d775" class="outline-3">
<h3 id="org475d775"><span class="section-number-3">11.4</span> Git</h3>
<div class="outline-text-3" id="text-11-4">
<ul class="org-ul">
<li><a href="http://magit.github.io/">Magit</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org53acd35" class="outline-2">
<h2 id="org53acd35"><span class="section-number-2">12</span> Programming</h2>
<div class="outline-text-2" id="text-12">
</div><div id="outline-container-org7d583b0" class="outline-3">
<h3 id="org7d583b0"><span class="section-number-3">12.1</span> C</h3>
</div>
<div id="outline-container-org52f98e5" class="outline-3">
<h3 id="org52f98e5"><span class="section-number-3">12.2</span> Lisp</h3>
</div>
</div>
<div id="outline-container-org66007a4" class="outline-2">
<h2 id="org66007a4"><span class="section-number-2">13</span> hydra</h2>
<div class="outline-text-2" id="text-13">
<p>
聚合功能 更方便输入 并且 辅助记忆差 手速低 的我
</p>
</div>
