articles/emacs-note.org
** Window
#+BEGIN_SRC emacs-lisp
(global-set-key
 (kbd "<f2>")
 (defhydra f2-fun (:color pink :hint nil)
   "
Window
^ Resize ^         ^ Move ^       ^Split^      ^Delete
^^^^^^^^-----------------------------------------------------------------
_e_: enlarge         ^_i_^          _v_:|      _dw_:del-current
_s_: shrink       _j_     _l_       _x_:-      _da_:ace-del
_E_: enlarge-<>      ^_k_^          _|_:>move  _do_:del-other
_S_: shrink-<>     _ws_:swap      ___:Vmove ^ ^_db_:kill-buf
_bw_: balance      ^<Jump>^         ^^^^       _df_:del-frame 
^ ^                _a_:ace _f_:to-frame
"

   ("e" #'enlarge-window)
   ("s" #'shrink-window)
   ("E" #'enlarge-window-horizontally)
   ("S" #'shrink-window-horizontally)
   ("bw" #'balance-windows)
   ;; Move
   ("j" #'windmove-left)
   ("i" #'windmove-up)
   ("l" #'windmove-right)
   ("k" #'windmove-down)
   ("ws" ace-swap-window)
   ;; Jump
   ("a" ace-window :exit t)
   ("f" #'select-frame-by-name :exit t)
   ;; Spilt
   ("|" (lambda ()
          (interactive)
          (split-window-right)
          (windmove-right)))
   ("_" (lambda ()
          (interactive)
          (split-window-below)
          (windmove-down)))
   ("v" #'split-window-right)
   ("x" #'split-window-below)
   ;; Delete
   ("da" ace-delete-window)
   ("dw" delete-window)
   ("do" delete-other-windows :exit t)
   ("db" kill-this-buffer)
   ("df" delete-frame :exit t)
   ;; Misc
   ("t" transpose-frame "-<->|")
   ("nf" new-frame "New-frame" :exit t)
   ("z" #'text-scale-adjust "Zoom" :exit t)
   ;;
   ("q" nil "Quit" :color blue)))

#+END_SRC

** hydra mc
#+BEGIN_SRC emacs-lisp
(global-set-key
 (kbd "C-S-c")
 (defhydra hydra-mc  (:columns 5)
   "multiple-cursors"
   ("ll" mc/edit-lines "lines")
   ("le" mc/edit-ends-of-lines "end-lines")
   
   ("j" mc/mark-next-like-this "next")
   ("uj" mc/unmark-next-like-this "un-n")
   ("J" mc/skip-to-next-like-this "skip-n")
   ("s" #'mc/mark-next-like-this-symbol "symbols-n")

   ("k" mc/mark-previous-like-this "prev")
   ("uk" mc/unmark-previous-like-this "un-p")
   ("K" mc/skip-to-previous-like-this "skip-p")
   
   ("aa" mc/mark-all-like-this "all")
   ("A" mc/mark-all-dwim "dwim")
   ("aw" #'mc/mark-all-words-like-this "word")
   ("as" mc/mark-all-symbols-like-this-in-defun "symbols-in-def")
   
   ("r" #'mc/mark-all-in-region-regexp "region-regexp")
   ;; Quit
   ("q" nil "Quit" :color blue)))

;; ("i" mc/insert-numbers)
;; ( "h" mc-hide-unmatched-lines-mode)
;; ( "dr" mc/reverse-regions)
;; ( "ds" mc/sort-regions)

#+END_SRC

* Config

** Ace Window
#+BEGIN_SRC emacs-lisp
(use-package ace-window
  :config
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  (ace-window-display-mode)
  :bind ("S-o" . ace-window))
#+END_SRC

