articles/emacs-note.html

<div id="outline-container-orge559a3b" class="outline-3">
<h3 id="orge559a3b"><span class="section-number-3">13.1</span> Window</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span>global-set-key
 <span style="color: #006400;">(</span>kbd <span style="color: #61CE3C;">"&lt;f2&gt;"</span><span style="color: #006400;">)</span>
 <span style="color: #006400;">(</span><span style="color: #4c83ff;">defhydra</span> f2-fun <span style="color: #ff1493;">(</span><span style="color: #4c83ff;">:color</span> pink <span style="color: #4c83ff;">:hint</span> nil<span style="color: #ff1493;">)</span>
   <span style="color: #FBDE2D;">"</span>
<span style="color: #FBDE2D;">Window</span>
<span style="color: #FBDE2D;">^ Resize ^         ^ Move ^       ^Split^      ^Delete</span>
<span style="color: #FBDE2D;">^^^^^^^^-----------------------------------------------------------------</span>
<span style="color: #FBDE2D;">_e_: enlarge         ^_i_^          _v_:|      _dw_:del-current</span>
<span style="color: #FBDE2D;">_s_: shrink       _j_     _l_       _x_:-      _da_:ace-del</span>
<span style="color: #FBDE2D;">_E_: enlarge-&lt;&gt;      ^_k_^          _|_:&gt;move  _do_:del-other</span>
<span style="color: #FBDE2D;">_S_: shrink-&lt;&gt;     _ws_:swap      ___:Vmove ^ ^_db_:kill-buf</span>
<span style="color: #FBDE2D;">_bw_: balance      ^&lt;Jump&gt;^         ^^^^       _df_:del-frame </span>
<span style="color: #FBDE2D;">^ ^                _a_:ace _f_:to-frame</span>
<span style="color: #FBDE2D;">"</span>

   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"e"</span> #'enlarge-window<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"s"</span> #'shrink-window<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"E"</span> #'enlarge-window-horizontally<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"S"</span> #'shrink-window-horizontally<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"bw"</span> #'balance-windows<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Move</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"j"</span> #'windmove-left<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"i"</span> #'windmove-up<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"l"</span> #'windmove-right<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"k"</span> #'windmove-down<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"ws"</span> ace-swap-window<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Jump</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"a"</span> ace-window <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"f"</span> #'select-frame-by-name <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Spilt</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"|"</span> <span style="color: #ffff00;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #00ff00;">()</span>
          <span style="color: #00ff00;">(</span><span style="color: #4c83ff;">interactive</span><span style="color: #00ff00;">)</span>
          <span style="color: #00ff00;">(</span>split-window-right<span style="color: #00ff00;">)</span>
          <span style="color: #00ff00;">(</span>windmove-right<span style="color: #00ff00;">)</span><span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"_"</span> <span style="color: #ffff00;">(</span><span style="color: #4c83ff;">lambda</span> <span style="color: #00ff00;">()</span>
          <span style="color: #00ff00;">(</span><span style="color: #4c83ff;">interactive</span><span style="color: #00ff00;">)</span>
          <span style="color: #00ff00;">(</span>split-window-below<span style="color: #00ff00;">)</span>
          <span style="color: #00ff00;">(</span>windmove-down<span style="color: #00ff00;">)</span><span style="color: #ffff00;">)</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"v"</span> #'split-window-right<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"x"</span> #'split-window-below<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Delete</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"da"</span> ace-delete-window<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"dw"</span> delete-window<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"do"</span> delete-other-windows <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"db"</span> kill-this-buffer<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"df"</span> delete-frame <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Misc</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"t"</span> transpose-frame <span style="color: #61CE3C;">"-&lt;-&gt;|"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"nf"</span> new-frame <span style="color: #61CE3C;">"New-frame"</span> <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"z"</span> #'text-scale-adjust <span style="color: #61CE3C;">"Zoom"</span> <span style="color: #4c83ff;">:exit</span> t<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;;</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"q"</span> nil <span style="color: #61CE3C;">"Quit"</span> <span style="color: #4c83ff;">:color</span> blue<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-orgba2f9d0" class="outline-3">
<h3 id="orgba2f9d0"><span class="section-number-3">13.2</span> hydra mc</h3>
<div class="outline-text-3" id="text-13-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span>global-set-key
 <span style="color: #006400;">(</span>kbd <span style="color: #61CE3C;">"C-S-c"</span><span style="color: #006400;">)</span>
 <span style="color: #006400;">(</span><span style="color: #4c83ff;">defhydra</span> hydra-mc  <span style="color: #ff1493;">(</span><span style="color: #4c83ff;">:columns</span> 5<span style="color: #ff1493;">)</span>
   <span style="color: #FBDE2D;">"multiple-cursors"</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"ll"</span> mc/edit-lines <span style="color: #61CE3C;">"lines"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"le"</span> mc/edit-ends-of-lines <span style="color: #61CE3C;">"end-lines"</span><span style="color: #ff1493;">)</span>
   
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"j"</span> mc/mark-next-like-this <span style="color: #61CE3C;">"next"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"uj"</span> mc/unmark-next-like-this <span style="color: #61CE3C;">"un-n"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"J"</span> mc/skip-to-next-like-this <span style="color: #61CE3C;">"skip-n"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"s"</span> #'mc/mark-next-like-this-symbol <span style="color: #61CE3C;">"symbols-n"</span><span style="color: #ff1493;">)</span>

   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"k"</span> mc/mark-previous-like-this <span style="color: #61CE3C;">"prev"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"uk"</span> mc/unmark-previous-like-this <span style="color: #61CE3C;">"un-p"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"K"</span> mc/skip-to-previous-like-this <span style="color: #61CE3C;">"skip-p"</span><span style="color: #ff1493;">)</span>
   
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"aa"</span> mc/mark-all-like-this <span style="color: #61CE3C;">"all"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"A"</span> mc/mark-all-dwim <span style="color: #61CE3C;">"dwim"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"aw"</span> #'mc/mark-all-words-like-this <span style="color: #61CE3C;">"word"</span><span style="color: #ff1493;">)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"as"</span> mc/mark-all-symbols-like-this-in-defun <span style="color: #61CE3C;">"symbols-in-def"</span><span style="color: #ff1493;">)</span>
   
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"r"</span> #'mc/mark-all-in-region-regexp <span style="color: #61CE3C;">"region-regexp"</span><span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">Quit</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"q"</span> nil <span style="color: #61CE3C;">"Quit"</span> <span style="color: #4c83ff;">:color</span> blue<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">("i" mc/insert-numbers)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">( "h" mc-hide-unmatched-lines-mode)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">( "dr" mc/reverse-regions)</span>
<span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">( "ds" mc/sort-regions)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0d5224b" class="outline-2">
<h2 id="org0d5224b"><span class="section-number-2">14</span> Config</h2>
<div class="outline-text-2" id="text-14">
</div><div id="outline-container-org8afc42d" class="outline-3">
<h3 id="org8afc42d"><span class="section-number-3">14.1</span> Ace Window</h3>
<div class="outline-text-3" id="text-14-1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">use-package</span> <span style="color: #96CBFE;">ace-window</span>
  <span style="color: #4c83ff;">:config</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">setq</span> aw-keys '<span style="color: #ff1493;">(</span>?a ?s ?d ?f ?g ?h ?j ?k ?l<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>ace-window-display-mode<span style="color: #006400;">)</span>
  <span style="color: #4c83ff;">:bind</span> <span style="color: #006400;">(</span><span style="color: #61CE3C;">"S-o"</span> . ace-window<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
