articles/emacs-note.org
** Avy
#+BEGIN_SRC emacs-lisp
(use-package avy
  :bind
  (("C-;" . 'avy-goto-char)
   ;; ("C-'" . 'avy-goto-char-2)
   ("M-g g" . 'avy-goto-line)
   ;; ("M-g e" . 'avy-goto-word-0)
   ("M-g w" . 'avy-goto-word-1)))
#+END_SRC
 
** Undo Tree
#+BEGIN_SRC emacs-lisp
(use-package undo-tree
  :diminish undo-tree-mode
  :config
  (global-undo-tree-mode))
#+END_SRC

** whole line or region
#+BEGIN_SRC emacs-lisp
(use-package whole-line-or-region
  :diminish whole-line-or-region-mode
  :config
  (whole-line-or-region-mode t)
  (make-variable-buffer-local 'whole-line-or-region-mode))
#+END_SRC

** Mutiple cursors
#+begin_src emacs-lisp
(use-package multiple-cursors
  :config
  (setq mc/always-run-for-all t))

(bind-key "M-<down-mouse-1>" 'mc/add-cursor-on-click)
(unbind-key "M-<down-mouse-1>" redshank-mode-map)
#+end_src

** Highlight Line

#+BEGIN_SRC emacs-lisp
(global-hl-line-mode 1)
#+END_SRC
