articles/emacs-note.html

<div id="outline-container-orgb55e9bc" class="outline-3">
<h3 id="orgb55e9bc"><span class="section-number-3">14.2</span> Avy</h3>
<div class="outline-text-3" id="text-14-2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">use-package</span> <span style="color: #96CBFE;">avy</span>
  <span style="color: #4c83ff;">:bind</span>
  <span style="color: #006400;">(</span><span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"C-;"</span> . 'avy-goto-char<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">("C-'" . 'avy-goto-char-2)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"M-g g"</span> . 'avy-goto-line<span style="color: #ff1493;">)</span>
   <span style="color: #8B8989; font-style: italic;">;; </span><span style="color: #8B8989; font-style: italic;">("M-g e" . 'avy-goto-word-0)</span>
   <span style="color: #ff1493;">(</span><span style="color: #61CE3C;">"M-g w"</span> . 'avy-goto-word-1<span style="color: #ff1493;">)</span><span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ab7693" class="outline-3">
<h3 id="org7ab7693"><span class="section-number-3">14.3</span> Undo Tree</h3>
<div class="outline-text-3" id="text-14-3">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">use-package</span> <span style="color: #96CBFE;">undo-tree</span>
  <span style="color: #4c83ff;">:diminish</span> undo-tree-mode
  <span style="color: #4c83ff;">:config</span>
  <span style="color: #006400;">(</span>global-undo-tree-mode<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgda39039" class="outline-3">
<h3 id="orgda39039"><span class="section-number-3">14.4</span> whole line or region</h3>
<div class="outline-text-3" id="text-14-4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">use-package</span> <span style="color: #96CBFE;">whole-line-or-region</span>
  <span style="color: #4c83ff;">:diminish</span> whole-line-or-region-mode
  <span style="color: #4c83ff;">:config</span>
  <span style="color: #006400;">(</span>whole-line-or-region-mode t<span style="color: #006400;">)</span>
  <span style="color: #006400;">(</span>make-variable-buffer-local 'whole-line-or-region-mode<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9af7374" class="outline-3">
<h3 id="org9af7374"><span class="section-number-3">14.5</span> Mutiple cursors</h3>
<div class="outline-text-3" id="text-14-5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span><span style="color: #4c83ff;">use-package</span> <span style="color: #96CBFE;">multiple-cursors</span>
  <span style="color: #4c83ff;">:config</span>
  <span style="color: #006400;">(</span><span style="color: #4c83ff;">setq</span> mc/always-run-for-all t<span style="color: #006400;">)</span><span style="color: #8b0000;">)</span>

<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">bind-key</span> <span style="color: #61CE3C;">"M-&lt;down-mouse-1&gt;"</span> 'mc/add-cursor-on-click<span style="color: #8b0000;">)</span>
<span style="color: #8b0000;">(</span><span style="color: #4c83ff;">unbind-key</span> <span style="color: #61CE3C;">"M-&lt;down-mouse-1&gt;"</span> redshank-mode-map<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd97d13c" class="outline-3">
<h3 id="orgd97d13c"><span class="section-number-3">14.6</span> Highlight Line</h3>
<div class="outline-text-3" id="text-14-6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #8b0000;">(</span>global-hl-line-mode 1<span style="color: #8b0000;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
